{
  "Header": {
    "tech": "Tecnologías",
    "experience": "Experiencia",
    "projects": "Proyectos",
    "downloadCV": "Descargar CV"
  },
  "Profile": {
    "greeting": "Hola, soy Vicente Gabriel Gómez Medina",
    "jobTitle": "Desarrollador Backend especializado en .NET",
    "bio": "Apasionado por transformar ideas en soluciones de software robustas y escalables. Mi enfoque se centra en la arquitectura limpia, el rendimiento y la creación de APIs que impulsan experiencias de usuario excepcionales.",
    "downloadCV": "Descargar CV",
    "visit": "Visitar mi",
    "profilePictureAlt": "Fotografía profesional de Vicente Gabriel Gómez Medina, Desarrollador Backend .NET."
  },
  "TechStack": {
    "title": "Tecnologías con las que trabajo",
    "dotnet": "Construcción de servicios backend y APIs robustas y escalables con el ecosistema .NET.",
    "javascript": "Lenguaje versátil para frontends web dinámicos e interactivos.",
    "react": "Creación de interfaces de usuario modernas, rápidas y escalables con esta potente librería.",
    "typescript": "Mejora de JavaScript con tipos estáticos para un código más fiable y mantenible.",
    "tailwind": "Framework CSS utility-first para construir rápidamente interfaces de usuario personalizadas.",
    "sql": "Diseño y gestión de bases de datos relacionales, principalmente con SQL Server."
  },
  "Timeline": {
    "title": "Mi Trayectoria Profesional",
    "experience": {
      "title": "Experiencia",
      "exp1": {
        "role": "Backend .NET Developer",
        "company": "Tech Solutions Inc.",
        "period": "Ene 2021 - Actualidad",
        "achievements": [
          "Lideré la migración de un monolito a una arquitectura de microservicios, mejorando la escalabilidad y reduciendo el tiempo de despliegue en un 40%.",
          "Diseñé e implementé un sistema de caché con Redis que disminuyó la latencia de la API en un 60% para las consultas más frecuentes.",
          "Automaticé el pipeline CI/CD con Azure DevOps, permitiendo entregas de software más rápidas y fiables."
        ]
      },
      "exp2": {
        "role": "Junior Software Developer",
        "company": "Innovatech Ltd.",
        "period": "Jun 2019 - Dic 2020",
        "achievements": [
          "Participé en el desarrollo de una aplicación web con ASP.NET MVC, contribuyendo a un aumento del 15% en la satisfacción del cliente.",
          "Optimicé consultas SQL complejas, lo que resultó en una reducción del 30% en los tiempos de carga de los informes críticos.",
          "Implementé tests unitarios y de integración, aumentando la cobertura de código del 20% al 75% en módulos clave."
        ]
      }
    },
    "education": {
      "title": "Formación",
      "edu1": {
        "degree": "Grado Superior en Desarrollo de Aplicaciones Web",
        "institution": "IES El Rincón",
        "period": "2017 - 2019"
      },
      "edu2": {
        "degree": "Curso de Inglés Avanzado C1",
        "institution": "Escuela Oficial de Idiomas",
        "period": "2022 - Presente"
      },
      "edu3": {
        "degree": "Grado en Ingeniería Informática",
        "institution": "Universidad de Las Palmas de Gran Canaria",
        "period": "2019 - 2021"
      },
      "statuses": {
        "finished": "Finalizado",
        "inProgress": "En curso",
        "onHold": "En pausa"
      }
    },
    "volunteering": {
      "title": "Voluntariado",
      "vol1": {
        "role": "Community Mentor",
        "organization": "Code for All",
        "period": "2022 - Presente",
        "description": "Guiando a futuros desarrolladores a través de mentorías, compartiendo buenas prácticas y consejos de carrera."
      },
      "vol2": {
        "role": "Event Volunteer",
        "organization": "Tech Conference 2023",
        "period": "Oct 2023",
        "description": "Colaboré en la logística para asegurar una experiencia fluida para más de 500 asistentes."
      }
    },
    "events": {
      "title": "Eventos",
      "event1": {
        "name": "Conferencia Anual de Desarrolladores",
        "organization": "Global Tech",
        "date": "Junio 2023",
        "description": "Participé como asistente, atendiendo a charlas sobre las últimas tendencias en desarrollo de software, serverless y arquitectura de microservicios."
      },
      "event2": {
        "name": "Hackathon de Innovación Social",
        "organization": "Code for Good",
        "date": "Marzo 2022",
        "description": "Formé parte de un equipo que desarrolló un prototipo de aplicación para conectar a voluntarios con ONGs locales, obteniendo el segundo lugar."
      }
    }
  },
  "Projects": {
    "title": "Proyectos Destacados",
    "projectImageAlt": "Imagen del proyecto",
    "viewCode": "Ver código de",
    "code": "Código",
    "liveDemo": "Ver demo en vivo de",
    "demo": "Demo",
    "project1": {
      "title": "Proyecto Alfa",
      "description": "Una API RESTful de alto rendimiento construida con .NET 7 para gestionar datos de clientes, optimizando las consultas en un 50%."
    },
    "project2": {
      "title": "Proyecto Beta",
      "description": "Migración de una aplicación monolítica a una arquitectura de microservicios, mejorando la escalabilidad y el mantenimiento."
    },
    "project3": {
      "title": "Proyecto Gamma",
      "description": "Desarrollo de un sistema de procesamiento de datos en tiempo real utilizando SignalR y colas de mensajes para notificaciones instantáneas."
    }
  },
  "Footer": {
    "rights": "Todos los derechos reservados."
  }
}
